Revit 2024 API
ParameterTypeId.FloorStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FloorStructureIdParam { get; }
Visual Basic
Public Shared ReadOnly Property FloorStructureIdParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FloorStructureIdParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace